-- 模拟货区数据
INSERT INTO `wms_area` (`area_code`, `area_name`, `warehouse_id`, `area_type`, `status`, `remark`, `creator`, `tenant_id`) VALUES
('AREA2401001', '北京电子仓A区', 1, 0, 0, '存储区', 'admin', 1),
('AREA2401002', '北京电子仓B区', 1, 1, 0, '暂存区', 'admin', 1),
('AREA2401003', '深圳电子仓A区', 2, 0, 0, '存储区', 'admin', 1),
('AREA2401004', '深圳电子仓B区', 2, 1, 0, '暂存区', 'admin', 1),
('AREA2401005', '上海家电仓A区', 3, 0, 0, '存储区', 'admin', 1),
('AREA2401006', '上海家电仓B区', 3, 2, 0, '拣货区', 'admin', 1),
('AREA2401007', '广州家电仓A区', 4, 0, 0, '存储区', 'admin', 1),
('AREA2401008', '广州家电仓B区', 4, 3, 0, '出货区', 'admin', 1),
('AREA2401009', '杭州物料仓A区', 5, 0, 0, '存储区', 'admin', 1),
('AREA2401010', '杭州物料仓B区', 5, 1, 0, '暂存区', 'admin', 1);

-- 模拟货架数据
INSERT INTO `wms_rack` (`rack_code`, `rack_name`, `area_id`, `rack_type`, `status`, `remark`, `creator`, `tenant_id`) VALUES
('RACK2401001', '北京A区01货架', 1, 0, 0, '标准货架', 'admin', 1),
('RACK2401002', '北京A区02货架', 1, 0, 0, '标准货架', 'admin', 1),
('RACK2401003', '深圳A区01货架', 3, 0, 0, '标准货架', 'admin', 1),
('RACK2401004', '深圳A区02货架', 3, 1, 0, '重型货架', 'admin', 1),
('RACK2401005', '上海A区01货架', 5, 0, 0, '标准货架', 'admin', 1),
('RACK2401006', '上海A区02货架', 5, 1, 0, '重型货架', 'admin', 1),
('RACK2401007', '广州A区01货架', 7, 0, 0, '标准货架', 'admin', 1),
('RACK2401008', '广州A区02货架', 7, 2, 0, '悬臂货架', 'admin', 1),
('RACK2401009', '杭州A区01货架', 9, 0, 0, '标准货架', 'admin', 1),
('RACK2401010', '杭州A区02货架', 9, 0, 0, '标准货架', 'admin', 1);

-- 模拟库位数据
INSERT INTO `wms_location` (`location_code`, `location_name`, `rack_id`, `location_type`, `status`, `remark`, `creator`, `tenant_id`) VALUES
('LOC2401001', '北京A区01货架01号', 1, 0, 0, '普通库位', 'admin', 1),
('LOC2401002', '北京A区01货架02号', 1, 0, 0, '普通库位', 'admin', 1),
('LOC2401003', '深圳A区01货架01号', 3, 0, 0, '普通库位', 'admin', 1),
('LOC2401004', '深圳A区01货架02号', 3, 1, 0, '快检库位', 'admin', 1),
('LOC2401005', '上海A区01货架01号', 5, 0, 0, '普通库位', 'admin', 1),
('LOC2401006', '上海A区01货架02号', 5, 1, 0, '快检库位', 'admin', 1),
('LOC2401007', '广州A区01货架01号', 7, 0, 0, '普通库位', 'admin', 1),
('LOC2401008', '广州A区01货架02号', 7, 2, 0, '退货库位', 'admin', 1),
('LOC2401009', '杭州A区01货架01号', 9, 0, 0, '普通库位', 'admin', 1),
('LOC2401010', '杭州A区01货架02号', 9, 0, 0, '普通库位', 'admin', 1); 